
ПодключитьСценарий("..\src\BSLParser\Ext\ObjectModule.bsl", "ПарсерBSL");
ПодключитьСценарий("..\plugins\TestVars\src\TestVars\Ext\ObjectModule.bsl", "ПлагинТестПеременных");

ЧтениеТекста = New ЧтениеТекста("..\src\BSLParser\Ext\ObjectModule.bsl");
Исходник = ЧтениеТекста.Прочитать();

ПарсерBSL = New ПарсерBSL;
ПарсерBSL.ПоложениеУзлаВАСТ = Ложь;
Модуль = ПарсерBSL.РазобратьМодуль(Исходник);

ПлагинТестПеременных = New ПлагинТестПеременных;
ПарсерBSL.Подключить(ПлагинТестПеременных);
ПарсерBSL.ПосетитьМодуль(Модуль);

Сообщить(ПлагинТестПеременных.Результат());